cfg/InformationRegisters/СоответствиеПодразделенийИПодразделенийОрганизаций.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<InformationRegister>
		<Properties>
			<Name>СоответствиеПодразделенийИПодразделенийОрганизаций</Name>
			<Comment>Соответствие подразделений и подразделений организаций</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Подразделение</Name>
					<Comment>Подразделение</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Comment>Организация</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПодразделениеОрганизации</Name>
					<Comment>ПодразделениеОрганизации</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cfg/InformationRegisters/СоответствиеПодразделенийИПодразделенийОрганизаций/Forms/ФормаСписка/Ext/Form/Module.bsl
Процедура ДействияФормыЗаполнить(Кнопка)
	
	Запрос  = Новый Запрос;
	
	Запрос.Текст = 
	//"ВЫБРАТЬ
	// |	Подразделения.Ссылка КАК Подразделение,
	// |	Организации.Ссылка КАК Организация
	// |ИЗ
	// |	Справочник.Организации КАК Организации,
	// |	Справочник.Подразделения КАК Подразделения
	// |
	// |ГДЕ
	// |	(НЕ(1 В (ВЫБРАТЬ РАЗЛИЧНЫЕ 	1 ИЗ РегистрСведений.СоответствиеПодразделенийИПодразделенийОрганизаций КАК СоответствиеПодразделенийИПодразделенийОрганизаций ГДЕ 	СоответствиеПодразделенийИПодразделенийОрганизаций.Подразделение = Подразделения.Ссылка И СоответствиеПодразделенийИПодразделенийОрганизаций.Организация = Организации.Ссылка )))";
	
	
	  "ВЫБРАТЬ
	 |	ВложенныйЗапрос.Подразделение,
	 |	ВложенныйЗапрос.Организация,
	 |	СоответствиеПодразделенийИПодразделенийОрганизаций.ПодразделениеОрганизации
	 |ИЗ
	 |	(ВЫБРАТЬ
	 |		Подразделения.Ссылка КАК Подразделение,
	 |		Организации.Ссылка КАК Организация
	 |	ИЗ
	 |		Справочник.Организации КАК Организации,
	 |		Справочник.Подразделения КАК Подразделения) КАК ВложенныйЗапрос
	 |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СоответствиеПодразделенийИПодразделенийОрганизаций КАК СоответствиеПодразделенийИПодразделенийОрганизаций
	 |		ПО СоответствиеПодразделенийИПодразделенийОрганизаций.Организация = ВложенныйЗапрос.Организация И СоответствиеПодразделенийИПодразделенийОрганизаций.Подразделение = ВложенныйЗапрос.Подразделение
	 |
	 |ГДЕ
	 |	((СоответствиеПодразделенийИПодразделенийОрганизаций.ПодразделениеОрганизации) ЕСТЬ NULL )";
	
	 Выборка = Запрос.Выполнить().Выбрать();
	 
     Набор = РегистрыСведений.СоответствиеПодразделенийИПодразделенийОрганизаций.СоздатьНаборЗаписей();
     Набор.Прочитать();
	 Пока Выборка.Следующий() Цикл
		Запись = Набор.Добавить();
		Запись.Подразделение = Выборка.Подразделение;
		Запись.Организация   = Выборка.Организация;
	 КонецЦикла;
	Если Набор.Количество()>0 тогда
		Попытка
			Набор.Записать(Истина);
		Исключение
			Сообщить(ОписаниеОшибки());
		КонецПопытки
	КонецЕсли;		 

КонецПроцедуры
